{
  "backend/main.mo": "Main backend actor implementing fabric inventory management with user authentication, role-based access control (admin/office/worker), CRUD operations for fabric entries, quantity adjustments, audit logging, and blob storage integration for photos.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including fabric entry editing, React Query mutation hooks, barcode scanning with automatic fabric selection, and quantity adjustment controls with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (login, dashboard, scan, add fabric, admin), components (layout, inventory list, scanner, modals), hooks (authentication, queries), and styling configuration.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes with warm neutral palette and custom CSS properties for UI components.",
  "frontend/index.html": "HTML entry point for the Bho Creation Inventory App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, Internet Identity authentication flow, profile setup modal, and route definitions for dashboard, scan, add fabric, and admin pages with loading states and authentication guards.",
  "frontend/src/components/BarcodeScannerView.tsx": "Camera-based QR/barcode scanner component using useQRScanner hook with video preview, scan controls, camera switching, error handling, and scan results display that triggers onRackSelected callback.",
  "frontend/src/components/FabricEditModal.tsx": "Modal dialog for editing fabric inventory entries with form fields for name, rack ID, quantity, purchase date, and photo uploads (fabric and bill). Handles image preview, file size validation, upload progress tracking, and mutation submission.",
  "frontend/src/components/ImageLightbox.tsx": "Full-screen image viewer dialog that displays images in a dark overlay with close button and ESC key support for dismissal.",
  "frontend/src/components/InventoryDetailModal.tsx": "Read-only modal displaying detailed information for a fabric inventory entry including photos, name, rack ID, quantity, stock status badges, and purchase date with formatted timestamps.",
  "frontend/src/components/InventoryList.tsx": "Main inventory table component with search filtering, loading/error states, and action buttons to view details, edit entries, or open fabric/bill photos in lightbox. Displays fabric name, rack ID, quantity, and stock status badges.",
  "frontend/src/components/Layout.tsx": "Application layout wrapper with header containing logo, navigation buttons (Dashboard, Scan, Add Fabric, Admin Panel for admins), user profile display, and login button. Includes responsive mobile navigation.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between Sign In and Sign Out states using Internet Identity, with loading state and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Non-dismissible modal for first-time user profile setup requiring name and username input, defaulting new users to admin role.",
  "frontend/src/components/QuantityDeductionForm.tsx": "Form component for adjusting fabric inventory quantities (increase/decrease) by scanning rack barcodes, with validation to prevent negative quantities and real-time inventory updates.",
  "frontend/src/components/UserEditModal.tsx": "Modal dialog for editing user roles (admin, office, worker) with display of user details including principal ID and username.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, handling identity changes and invalidating dependent queries on actor updates.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including inventory management (CRUD, quantity adjustments) and user management (create, update, delete, role changes).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette for light/dark themes using warm amber/orange tones, plus keyframe animations for login page transitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AddFabricPage.tsx": "Form page for adding new fabric entries with fields for name, rack ID, quantity, purchase date, and photo uploads (fabric and bill). Handles image validation, preview, upload progress tracking, and converts files to ExternalBlob format before submission.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard for user management with functionality to create new users, edit existing users, promote to master admin, and display all users in a table. Includes role-based access control and validation for principal IDs and usernames.",
  "frontend/src/pages/DashboardPage.tsx": "Main inventory dashboard page displaying the InventoryList component with navigation buttons to add fabric or scan barcodes. Serves as the primary landing page after login.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with Internet Identity authentication, featuring animated background elements, branding, and feature highlights for the fabric inventory management system.",
  "frontend/src/pages/ScanPage.tsx": "Barcode scanning page that matches scanned codes against inventory by fabric name or rack ID, then displays a quantity deduction form for the matched fabric entry.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining a web-based inventory management system for Bho Creation clothing manufacturing with barcode scanning, role-based authentication (Master Admin, Office Staff, Workers), and real-time multi-user sync. Built with React/TypeScript frontend and Motoko backend on Internet Computer, featuring fabric inventory tracking, audit trails, and mobile-responsive design."
}