{
  "backend/main.mo": "Main Motoko actor implementing inventory management with user authentication (username/password and Internet Identity), role-based access control (admin/user/guest), fabric/item CRUD operations with photo storage, quantity adjustments, audit logging, and QR code generation for rack IDs.",
  "feature_evidence.json": "Feature evidence report documenting PWA implementation including web app manifest creation, service worker registration, HTML meta tag updates, and install prompt component with high confidence test mappings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend components describing authentication flows, mobile-optimized UI with 44px touch targets, inventory management pages, barcode scanning, profile setup, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, accent, and sidebar colors in warm amber/orange palette.",
  "frontend/index.html": "HTML entry point with PWA meta tags including manifest link, theme color, apple-mobile-web-app-capable settings, and apple-touch-icon reference for progressive web app functionality.",
  "frontend/public/manifest.json": "Web app manifest defining 'Bho Creation Inventory' as a standalone PWA with portrait orientation, amber theme color, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for offline support, caching static assets on install, cleaning old caches on activate, and serving cached content with network fallback for GET requests.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, dual authentication support (Internet Identity and credential-based), profile setup modal for first-time users, install prompt rendering, and route definitions for dashboard, scan, add fabric, and admin pages.",
  "frontend/src/components/BarcodeScannerView.tsx": "React component that provides a barcode/QR scanner interface using the device camera, with controls to start/stop scanning, switch cameras, and displays scan results. Calls onRackSelected callback when a QR code is detected.",
  "frontend/src/components/FabricEditModal.tsx": "Modal dialog component for editing fabric/inventory entries with form fields for name, type, quantity, unit, purchase date, and photo uploads (item and bill). Handles image preview, validation, and calls useUpdateFabricEntry mutation on submit.",
  "frontend/src/components/ImageLightbox.tsx": "Simple fullscreen image viewer dialog component that displays an image in a lightbox overlay with close button and ESC key support.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt component that detects platform (iOS/Android) and shows appropriate installation instructions, with dismiss functionality and localStorage persistence. Handles beforeinstallprompt event for Android and shows manual instructions for iOS.",
  "frontend/src/components/InventoryDetailModal.tsx": "Modal dialog that displays detailed information for a single inventory entry including photos, item type, name, rack ID, stock status, quantity, purchase date, and bill photo. Supports opening images in lightbox view.",
  "frontend/src/components/InventoryList.tsx": "Table view component that displays all inventory items with search/filter functionality, showing rack ID, item name, type, quantity, and photos. Provides actions to view details, edit entries, and open images in lightbox.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, navigation (dashboard, scan, add fabric, admin panel), and mobile-responsive menu. Displays user profile and conditionally shows admin navigation based on user role.",
  "frontend/src/components/LoginButton.tsx": "Logout button component that handles both Internet Identity and credential-based authentication, clearing the query client on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup with fields for name, username, and optional master admin promotion with password. Only displays when user profile is null.",
  "frontend/src/components/QuantityDeductionForm.tsx": "Form component for adjusting fabric inventory quantities (increase/decrease) with validation, stock status badges, and current item information display.",
  "frontend/src/components/UserEditModal.tsx": "Modal dialog for editing user roles (Master Admin, Office Staff, Worker) with user details display and role update functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including fabric inventory management (add, update, adjust quantity), user profile management, and user administration (create, promote, get all users).",
  "frontend/src/index.css": "Contains Tailwind CSS configuration with warm amber/orange color palette, dark mode support, touch optimization utilities, mobile-friendly styles, and custom animations (fadeIn, slideIn, float) for the login page.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for React Query and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AddFabricPage.tsx": "Form page for adding new fabric entries with fields for name, rack ID, quantity, item type, unit, purchase date, and photo uploads (fabric and bill) with preview and progress tracking.",
  "frontend/src/pages/AdminPanel.tsx": "Admin interface for user management displaying all users in a table, allowing creation of new users with principal/username/password/role, and enabling self-promotion to Master Admin with password verification.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying the inventory list with navigation buttons to add fabric or scan barcodes.",
  "frontend/src/pages/LoginPage.tsx": "Login page with animated background, branding elements, feature highlights, and dual authentication options (Internet Identity and username/password credentials).",
  "frontend/src/pages/ScanPage.tsx": "React page component for barcode scanning that allows users to scan barcodes to select inventory items by fabric name or rack ID, then displays a quantity deduction form for the matched item.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system, typography, animations, and design tokens for a professional inventory management UI with warm color palette.",
  "project_state.json": "Project metadata file documenting the web-based inventory management system for Bho Creation, including architecture notes, role-based authentication requirements, barcode scanning features, and known platform limitations."
}