{
  "backend/main.mo": "Main backend actor implementing fabric inventory management with role-based access control (admin/office/worker), user profiles, audit logging, and blob storage for photos. Includes one-time master admin bootstrap function and CRUD operations for inventory and users.",
  "feature_evidence.json": "Feature evidence report documenting a request to replace the current logo image (101843004_247003263392167_3873501175990976512_n.jpg) in the Layout component header with a clothing brand appropriate logo for Bho Creation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (login, dashboard, scan, add fabric, admin), components (layout with logo, inventory list, scanner, forms, modals), hooks for backend queries, and styling configuration with warm amber/orange color palette.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode variables for a warm, professional manufacturing aesthetic with neutral grays and amber/orange accents.",
  "frontend/index.html": "HTML entry point for the Bho Creation Inventory App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, Internet Identity authentication flow, profile setup modal for new users, and routes for dashboard, scan, add fabric, and admin panel with loading states and authentication guards.",
  "frontend/src/components/BarcodeScannerView.tsx": "Camera-based QR/barcode scanner component using useQRScanner hook with video preview, scan controls, camera switching, error handling, and scan results display that triggers onRackSelected callback.",
  "frontend/src/components/ImageLightbox.tsx": "Modal lightbox component for full-size image viewing with dark background, close button, ESC key support, and click-outside-to-close functionality.",
  "frontend/src/components/InventoryDetailModal.tsx": "Modal component that displays detailed information about a fabric inventory entry, including photo, name, rack ID, quantity, stock status, and dates. Supports image lightbox viewing.",
  "frontend/src/components/InventoryList.tsx": "Displays a searchable table of all fabric inventory entries with filtering by fabric name or rack ID. Shows fabric photos, quantities, stock status badges, and provides detail view and image lightbox functionality.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with header, navigation (Dashboard, Scan, Add Fabric, Admin Panel), and login button. Handles responsive mobile/desktop navigation and role-based admin access.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for new users to create their profile with name and username fields. Sets default admin role and prevents dismissal until profile is created.",
  "frontend/src/components/QuantityDeductionForm.tsx": "Form component for deducting fabric quantity from a scanned rack ID. Displays current fabric details and validates quantity before updating inventory.",
  "frontend/src/components/UserEditModal.tsx": "Modal dialog component for editing user roles, displaying user details (name, username, principal) and allowing role selection between admin, office staff, and worker with save/cancel actions.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, creating actors based on Internet Identity state and initializing access control with admin tokens from URL parameters.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, fabric inventory CRUD operations, and user management (create, update roles, promote to admin).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette for manufacturing/industrial theme, including light/dark mode variables and animation keyframes for login page effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AddFabricPage.tsx": "Form page for adding new fabric inventory entries with fields for fabric name, rack ID, quantity, purchase date, and optional photo uploads (fabric and bill) with validation and preview functionality.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page for managing users with role-based access control. Allows Master Admin to create users, edit profiles, promote users to Master Admin, and view all users in a table with role badges.",
  "frontend/src/pages/DashboardPage.tsx": "Main inventory dashboard page displaying fabric stock list with navigation buttons to add fabric and scan barcodes. Includes header with title and action buttons.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with Internet Identity authentication, featuring animated background, branding for Bho Creation, and feature highlights for barcode scanning and stock control.",
  "frontend/src/pages/ScanPage.tsx": "Barcode scanning page with two-column layout: barcode scanner view on left and quantity deduction form on right for updating fabric stock.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both hash-based and browser-based routing with parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, custom shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining a web-based fabric inventory management system for Bho Creation with role-based authentication, barcode scanning, real-time sync, and audit trails built on Internet Computer with React/TypeScript frontend and Motoko backend."
}