{
  "backend/main.mo": "Main backend actor implementing fabric inventory management with user profiles, role-based access control, audit logging, and CRUD operations for fabric entries including photo storage and quantity tracking.",
  "feature_evidence.json": "Feature evidence report documenting the LoginPage redesign task with references to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system for light and dark modes, custom CSS variables, and base styling for the application.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component with TanStack Router configuration, authentication flow, profile setup modal logic, and protected route definitions for dashboard, scan, and add fabric pages.",
  "frontend/src/components/BarcodeScannerView.tsx": "Camera-based QR/barcode scanner component with video preview, scan controls, error handling, and results display using the useQRScanner hook.",
  "frontend/src/components/ImageLightbox.tsx": "Modal lightbox component for full-size image viewing with dark backdrop, ESC key support, and click-to-close functionality.",
  "frontend/src/components/InventoryDetailModal.tsx": "Modal dialog displaying complete fabric entry details including photos, basic information, purchase date, stock status badges, and clickable images that open in lightbox.",
  "frontend/src/components/InventoryList.tsx": "Displays a searchable table of fabric inventory entries with filtering, image lightbox, and detail modal functionality. Includes loading states, empty states, and search by fabric name or rack ID.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header, navigation (Dashboard, Scan, Add Fabric), and user profile display. Includes responsive mobile navigation and login button integration.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name and username with default admin role assignment.",
  "frontend/src/components/QuantityDeductionForm.tsx": "Form component for deducting fabric quantity from scanned rack IDs, with validation to prevent over-deduction and display of current fabric details.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, handling both authenticated and anonymous actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook to fetch the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing auth client creation, login/logout flow, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fabric inventory operations including saving user profiles, fetching inventory with auto-refresh, adding fabric entries with photos, and updating fabric quantities.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using warm amber/orange color palette for manufacturing context, plus keyframe animations for login page (fadeIn, slideIn, float).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/AddFabricPage.tsx": "Form page for adding new fabric inventory entries with fields for name, rack ID, quantity, purchase date, and optional fabric/bill photo uploads with validation and preview functionality.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying inventory list with navigation buttons to add fabric or scan barcodes for quantity updates.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with animated branding, feature highlights (barcode scanning, stock control, analytics), and Internet Identity login button for authentication.",
  "frontend/src/pages/ScanPage.tsx": "Barcode scanning page with two-column layout showing barcode scanner view and quantity deduction form for updating fabric inventory.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup methods for managing state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, custom fonts (Inter), border radius variables, shadows, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a web-based inventory management system for Bho Creation clothing manufacturing with barcode scanning, role-based authentication (Master Admin/Office Staff/Workers), fabric tracking with audit trails, and real-time sync built on React/TypeScript frontend with Motoko backend on Internet Computer."
}