{
  "backend/main.mo": "Main backend actor implementing user management with role-based access control (admin/user/guest), fabric inventory tracking with photos and audit logs, and blob storage mixins for handling image uploads.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence issues: Create User button not submitting forms, transparency issues in dialogs/modals, and need for console logging in user creation flow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and configuration, highlighting recent fixes for user creation parameter order, dialog transparency, and mobile touch optimization.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with warm amber/orange palette, plus base styling for body and border elements.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, theme color configuration, and apple-touch-icon for mobile installation.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, display mode (standalone), theme colors, and portrait orientation for installable web app experience.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with network fallback for offline support, caching static assets and successful GET responses.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, dual authentication (Internet Identity and credential-based), profile setup modal for new II users, and protected routes for dashboard, scan, add fabric, and admin pages.",
  "frontend/src/components/BarcodeScannerView.tsx": "React component that provides a QR/barcode scanner interface using the device camera, with controls to start/stop scanning, switch cameras, and displays scan results to select a rack ID.",
  "frontend/src/components/FabricEditModal.tsx": "Modal dialog component for editing fabric inventory entries, allowing users to update item type, name, quantity, unit, purchase date, and upload fabric/bill photos with progress tracking.",
  "frontend/src/components/ImageLightbox.tsx": "Simple fullscreen image viewer dialog component that displays an image in a lightbox overlay with close functionality via button or Escape key.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt component that detects platform (iOS/Android) and shows appropriate instructions or native install dialog to add the app to the home screen, with dismiss functionality.",
  "frontend/src/components/InventoryDetailModal.tsx": "Modal dialog that displays comprehensive details of a single inventory item including photos, item type, name, rack ID, stock status, quantity, purchase date, and bill photo with lightbox support.",
  "frontend/src/components/InventoryList.tsx": "Main inventory list component with search functionality that displays all inventory items in a table format, showing item photos, details, stock status, and action buttons for viewing details or editing entries.",
  "frontend/src/components/Layout.tsx": "Main layout component providing navigation header with dashboard, scan, add fabric, and admin panel links, plus mobile navigation and login button. Renders children with gradient background and role-based menu visibility.",
  "frontend/src/components/LoginButton.tsx": "Logout button component that handles both Internet Identity and credential-based authentication, clearing query cache on logout. Only renders when user is authenticated.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name and username, with optional master admin promotion requiring password. Blocks interaction until profile is created.",
  "frontend/src/components/QuantityDeductionForm.tsx": "Form component for adjusting fabric inventory quantities with increase/decrease operations, stock status badges, and validation to prevent negative quantities. Displays current item details and rack ID.",
  "frontend/src/components/UserEditModal.tsx": "Modal dialog for editing user roles (Master Admin, Office Staff, Worker) with user details display including principal ID. Handles role updates via mutation hook.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor. Returns null if no profile exists and handles loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity persistence, and authentication status states. Supports custom configuration options for auth client and login behavior.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profile management, fabric inventory CRUD operations (add, update, adjust quantity), and user management (create, get all users, promote to admin).",
  "frontend/src/index.css": "Global CSS file with Tailwind configuration, custom CSS variables for light/dark theme color palettes (warm amber/orange), animations (fadeIn, slideIn, float), touch optimization utilities, and dialog overlay fixes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AddFabricPage.tsx": "Page component for adding new fabric entries with form inputs for fabric details (name, rack ID, quantity, type, unit), photo uploads for fabric and bill with preview and progress tracking, and submission handling via useAddFabricEntry mutation.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard for user management displaying all users in a table, providing forms to create new users with principal/credentials, and allowing self-promotion to master admin with password verification.",
  "frontend/src/pages/DashboardPage.tsx": "Main inventory dashboard page with header, action buttons for adding fabric and scanning barcodes, and an InventoryList component to display all fabric entries.",
  "frontend/src/pages/LoginPage.tsx": "Login page with animated background, branding section featuring app logo and feature highlights, and dual authentication options supporting both Internet Identity and username/password credential login.",
  "frontend/src/pages/ScanPage.tsx": "React page component for barcode scanning that allows users to scan barcodes to select inventory items and adjust quantities. Displays a barcode scanner view and a quantity deduction form when an item is matched by fabric name or rack ID.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist URL parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system, typography, container queries, animations, and custom styling for a warm professional design aesthetic. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing a web-based inventory management system for fabric tracking with barcode scanning, role-based authentication, and real-time sync. Documents architectural decisions, known issues (transparency rendering, Create User button), and existing features including user authentication and inventory management."
}