{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Convert Bho Creation Inventory to Progressive Web App (PWA)",
  "requirements": [
    {
      "id": "REQ-55",
      "summary": "Create Web App Manifest file with app identity, standalone mode, and app icons",
      "acceptanceCriteria": [
        "Manifest file exists at frontend/public/manifest.json with valid JSON structure",
        "App name is set to 'Bho Creation Inventory'",
        "Display mode is set to 'standalone' for app-like experience",
        "Theme color matches the existing amber/orange color palette from index.css",
        "Start URL is configured to launch the main application"
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.json",
          "operation": "create",
          "description": "Create a Web App Manifest JSON file that defines the app name as 'Bho Creation Inventory', sets display mode to 'standalone', configures start_url to '/', and specifies theme_color and background_color using the amber/orange color scheme from index.css (hsl(20.5 90.2% 48.2%)). Include icons array with entries for the generated app icons at frontend/public/assets/generated/app-icon-192.dim_192x192.png (sizes: '192x192', type: 'image/png') and frontend/public/assets/generated/app-icon-512.dim_512x512.png (sizes: '512x512', type: 'image/png', purpose: 'any maskable'). Set short_name to 'Bho Inventory' and scope to '/'."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Implement Service Worker with offline caching strategy for static assets",
      "acceptanceCriteria": [
        "Service worker file exists at frontend/public/sw.js",
        "Service worker caches all critical static assets on installation",
        "App shell loads from cache when offline",
        "Service worker updates automatically when new version is deployed"
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Create a Service Worker JavaScript file that implements a cache-first strategy for static assets. Define a CACHE_NAME constant with version (e.g., 'bho-inventory-v1'). In the 'install' event listener, use event.waitUntil() to cache critical assets including '/', '/index.html', '/index.css', '/src/main.tsx', and the generated app icon images at frontend/public/assets/generated/app-icon-192.dim_192x192.png and frontend/public/assets/generated/app-icon-512.dim_512x512.png using caches.open() and cache.addAll(). In the 'activate' event listener, implement cache cleanup by deleting old cache versions. In the 'fetch' event listener, respond with cached assets using caches.match(), falling back to network fetch for uncached resources, and cache successful network responses for future offline access. Handle errors gracefully to ensure the app continues to function."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Add PWA meta tags and manifest link to HTML entry point",
      "acceptanceCriteria": [
        "Manifest link tag is present in index.html head section",
        "Meta tag for theme-color is configured with amber color",
        "Meta tag for apple-mobile-web-app-capable is set to 'yes'",
        "Meta tag for apple-mobile-web-app-status-bar-style is configured"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add PWA-specific meta tags and manifest link to the <head> section. Insert <link rel=\"manifest\" href=\"/manifest.json\"> to reference the web app manifest. Add <meta name=\"theme-color\" content=\"hsl(20.5 90.2% 48.2%)\"> to match the amber primary color from index.css. Add <meta name=\"apple-mobile-web-app-capable\" content=\"yes\"> to enable full-screen mode on iOS. Add <meta name=\"apple-mobile-web-app-status-bar-style\" content=\"black-translucent\"> for iOS status bar styling. Add <link rel=\"apple-touch-icon\" href=\"/assets/generated/apple-touch-icon.dim_180x180.png\"> to specify the iOS home screen icon using the generated image at frontend/public/assets/generated/apple-touch-icon.dim_180x180.png. Ensure existing viewport and charset meta tags remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-58",
      "summary": "Register Service Worker in main.tsx with lifecycle handling and update notifications",
      "acceptanceCriteria": [
        "Service worker registration code is added to main.tsx",
        "Registration only occurs in production builds (not development)",
        "User receives notification when app update is available",
        "Service worker errors are logged for debugging"
      ],
      "file_operations": [
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Add Service Worker registration logic after the ReactDOM.createRoot() call. Check if 'serviceWorker' is supported in navigator and if the environment is production (import.meta.env.PROD). If both conditions are true, register the service worker using navigator.serviceWorker.register('/sw.js'). Handle the registration promise: on success, listen for the 'updatefound' event on registration, and when a new service worker is installing, listen for its 'statechange' event. When the new worker's state becomes 'installed' and there's an existing active service worker, display a user-friendly notification (using a toast or alert) informing the user that a new version is available and prompting them to reload the page. On registration error, log the error to console with a descriptive message. Ensure this registration code runs only once during application initialization and does not interfere with existing InternetIdentityProvider or QueryClientProvider setup."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Create InstallPrompt component for Add to Home Screen functionality",
      "acceptanceCriteria": [
        "Install prompt component detects beforeinstallprompt event on Android",
        "Component displays appropriate install instructions for iOS users",
        "User can dismiss the install prompt",
        "Install prompt respects user's previous dismissal decision"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InstallPrompt.tsx",
          "operation": "create",
          "description": "Create a React component that detects PWA installation capability and displays an appropriate install prompt. Use useState to track the deferredPrompt event, visibility state, and user dismissal preference (check localStorage for 'pwa-install-dismissed' key). Use useEffect to listen for the 'beforeinstallprompt' event on Android devices, prevent default behavior, and store the event in state. Detect iOS devices using navigator.userAgent regex. Render a dismissible banner or card component (using shadcn/ui Card, Alert, or Dialog) positioned fixed at the bottom of the screen. For Android, display a primary action button 'Add to Home Screen' that calls deferredPrompt.prompt(), awaits the user's choice, and hides the prompt afterward. For iOS, display instructional text explaining how to manually add the app to the home screen using the Share button and 'Add to Home Screen' option. Include a close/dismiss button that sets the dismissal flag in localStorage and hides the component. Style the prompt using Tailwind CSS classes to match the existing amber/orange theme from index.css. Ensure the component does not show if already dismissed or if the app is already installed (check matchMedia('(display-mode: standalone)'))."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and render the InstallPrompt component within the main application layout after authentication is established. Position the InstallPrompt component inside the RouterProvider context, after the profile setup modal but outside any specific route components, so it appears across all pages. Ensure the component is conditionally rendered only when the user is authenticated (isAuthenticated is true), maintaining the existing authentication flow and modal logic for Internet Identity users without modification."
        }
      ]
    },
    {
      "id": "REQ-60",
      "summary": "Optimize touch interactions and mobile keyboard experiences",
      "acceptanceCriteria": [
        "All buttons and clickable elements meet minimum 44x44px touch target size",
        "Form inputs trigger appropriate mobile keyboard types (numeric for quantity, email for email fields)",
        "Barcode scanner interface is optimized for mobile touch controls",
        "Mobile navigation gestures work smoothly without conflicts"
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Add global CSS utility classes for mobile touch optimization. Define a .touch-target class that ensures minimum 44x44px dimensions using min-width, min-height, and appropriate padding. Add a .mobile-input class that applies comfortable padding and font-size of at least 16px to prevent iOS zoom on input focus. Create responsive tap highlight color using -webkit-tap-highlight-color with a semi-transparent amber color matching the theme. Add touch-action CSS property utilities to prevent unintended gestures. Ensure all interactive elements inherit proper cursor: pointer and have adequate spacing. Apply these optimizations globally to buttons, links, and form controls using Tailwind's @apply or direct CSS rules targeting button, a, input, select, and textarea selectors."
        },
        {
          "path": "frontend/src/components/BarcodeScannerView.tsx",
          "operation": "modify",
          "description": "Enhance the barcode scanner interface for mobile touch interactions. Ensure all camera control buttons (Start Scanning, Stop Scanning, Switch Camera) have explicit className properties that apply minimum 44x44px dimensions using Tailwind CSS (e.g., min-h-[44px] min-w-[44px] py-3 px-6). Increase the spacing between buttons to prevent accidental taps (use gap-4 or space-x-4 on the button container). Verify the camera preview video element has explicit dimensions with a stable aspect ratio to prevent layout collapse on mobile devices (e.g., aspect-video or explicit height like h-64 md:h-96). Ensure the video preview container has width: 100% and a min-height to maintain visibility. Add touch-friendly padding around interactive elements. Review and ensure existing mobile device detection logic properly displays the Switch Camera button only on mobile devices as specified in the camera component usage instructions. Test that disabled states are visually distinct and prevent interaction."
        },
        {
          "path": "frontend/src/pages/AddFabricPage.tsx",
          "operation": "modify",
          "description": "Optimize form inputs for mobile keyboard experiences by adding appropriate inputMode and type attributes. For the quantity input field, add inputMode=\"numeric\" and type=\"number\" to trigger the numeric keyboard on mobile devices. For the rack ID field, use inputMode=\"text\" with type=\"text\". For the purchase date field, ensure type=\"date\" is used to leverage native mobile date pickers. Add min-h-[44px] Tailwind class to all input fields, buttons, and select dropdowns to meet touch target size requirements. Increase spacing between form fields using gap-4 or gap-6 on the form container. Ensure submit and cancel buttons have adequate padding (py-3 px-6) and meet minimum 44x44px dimensions. Add proper labels with htmlFor attributes to improve mobile accessibility and increase the tappable area. Review photo upload buttons and ensure they have clear visual affordances with sufficient size for touch interaction."
        },
        {
          "path": "frontend/src/pages/ScanPage.tsx",
          "operation": "modify",
          "description": "Optimize the quantity deduction form and related controls for mobile touch interactions. Ensure the QuantityDeductionForm component's parent container and all interactive elements within the page meet the 44x44px touch target size requirement. Add Tailwind classes (min-h-[44px] min-w-[44px]) to any buttons or controls that trigger actions. Increase spacing between interactive elements to prevent accidental taps. Ensure the barcode scanner component renders with proper mobile optimization as updated in REQ-60's BarcodeScannerView changes. Review and adjust layout to be responsive and touch-friendly across different mobile screen sizes. Verify that navigation and form submission flows work smoothly on touch devices without conflicts or gesture interception issues."
        },
        {
          "path": "frontend/src/components/QuantityDeductionForm.tsx",
          "operation": "modify",
          "description": "Enhance mobile touch interaction and keyboard experience for the quantity adjustment form. Add inputMode=\"numeric\" and type=\"number\" to the quantity input field to trigger the numeric keyboard on mobile devices. Apply min-h-[44px] Tailwind class to the input field and all buttons (increase, decrease, submit) to meet touch target size requirements. Increase button padding to py-3 px-6 for better touch affordance. Add spacing between the increase and decrease buttons (gap-3 or gap-4) to prevent accidental taps. Ensure the form container has appropriate spacing (gap-4 or gap-6) between form elements. Verify that stock status indicators and visual feedback elements do not interfere with touch interactions. Ensure disabled button states are clearly visible and prevent touch interaction on low-stock or out-of-stock items as per existing validation logic."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Optimize navigation menu and header for mobile touch interactions. Ensure all navigation links and buttons in the header have minimum 44x44px touch target sizes by applying Tailwind classes (min-h-[44px] py-3 px-4). Increase spacing between navigation menu items (gap-4 or gap-6) to prevent accidental taps, especially in the mobile navigation menu. Verify the mobile menu toggle button (if present) meets touch target requirements. Ensure the logo and user profile display areas are responsive and do not interfere with navigation touch targets. Review responsive breakpoints to ensure the mobile navigation provides adequate spacing and tap targets on small screens. Apply consistent padding and touch-friendly styling across all interactive elements in the layout component to ensure smooth mobile navigation gestures without conflicts."
        }
      ]
    }
  ]
}